{"backend": "tensorflow", "config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["Title", 0, 0], ["FullDescription", 0, 0], ["Categorical", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "Title", "config": {"dtype": "float32", "name": "Title", "sparse": false, "batch_input_shape": [null, null]}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "FullDescription", "config": {"dtype": "float32", "name": "FullDescription", "sparse": false, "batch_input_shape": [null, null]}}, {"class_name": "Embedding", "inbound_nodes": [[["Title", 0, 0, {}]]], "name": "embedding_1", "config": {"input_dim": 7480, "trainable": true, "embeddings_regularizer": null, "embeddings_constraint": null, "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "mask_zero": false, "batch_input_shape": [null, null], "dtype": "float32", "name": "embedding_1", "output_dim": 64, "input_length": null}}, {"class_name": "Embedding", "inbound_nodes": [[["FullDescription", 0, 0, {}]]], "name": "embedding_2", "config": {"input_dim": 7480, "trainable": true, "embeddings_regularizer": null, "embeddings_constraint": null, "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "mask_zero": false, "batch_input_shape": [null, null], "dtype": "float32", "name": "embedding_2", "output_dim": 64, "input_length": null}}, {"class_name": "Conv1D", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "conv1d_1", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1], "padding": "valid", "filters": 16, "data_format": "channels_last", "activation": "relu", "kernel_size": [10], "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_1", "use_bias": true}}, {"class_name": "Conv1D", "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "conv1d_2", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1], "padding": "valid", "filters": 16, "data_format": "channels_last", "activation": "relu", "kernel_size": [10], "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_2", "use_bias": true}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "Categorical", "config": {"dtype": "float32", "name": "Categorical", "sparse": false, "batch_input_shape": [null, 1934]}}, {"class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "global_max_pooling1d_1", "config": {"trainable": true, "name": "global_max_pooling1d_1", "data_format": "channels_last"}}, {"class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "name": "global_max_pooling1d_2", "config": {"trainable": true, "name": "global_max_pooling1d_2", "data_format": "channels_last"}}, {"class_name": "Dense", "inbound_nodes": [[["Categorical", 0, 0, {}]]], "name": "dense_1", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "units": 64, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "use_bias": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}], ["global_max_pooling1d_2", 0, 0, {}], ["dense_1", 0, 0, {}]]], "name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}}, {"class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense_2", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "units": 1, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "use_bias": true}}]}, "keras_version": "2.2.4", "class_name": "Model"}